import re
#1. Символьный класс
s = 'Еду, Е+79931248866да, ;;;;ёдаа,,,,,,,,,,,,,,,,,,,,,,,,,,,,, ед89840001606575у, ЕДА 22 5912qiwdhq7 91qwe856 \t\r\neee19856 ggg19512 11 Приvet как deла'
m = re.findall("[А-Яа-я][А-Яа-я][А-Яа-я]", s)
m = re.findall("8[0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9]", s)
m = re.findall("\+7[0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9]", s)
m = re.findall("\+7[0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9]|8[0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9]", s)
m = re.findall("[a-z][a-z][a-z]", s)
#2. Квантификаторы
m = re.findall("8[0-9]{10}|\+7[0-9]{10}", s)
m = re.findall("8\d{10}|\+7\d{10}", s)
m = re.findall("\w{3,6}", s)
#\d - любой цифровой символ, аналог: [0-9]
#\w - любой символ слова, аналог: [0-9А-Яа-яA-Za-z]
m = re.findall("\D{5}", s)
#\D - любой НЕ цифровой символ
#\W - люблой НЕ символ слова
m = re.findall("\W{5}", s)
#\s - любой пробельный символ
m = re.findall("\s{4}", s)
# . - любой символ, кроме \n
m = re.findall(".{20}", s, flags=re.DOTALL)
m = re.findall(",+", s)
# + - поиск от 1 до беск. символов
# * - поиск от 0 до беск. символов\
# ? - поиск от 0 до 1 раза

#3. Объединяющие сохраняющие и не сохраняющие скобки
s = '<span class="name" style="font-weight: 100;font-size: 20px;margin: 0px;position: relative;">Задание 24. Задача № 611. (с сайта sdamgia.ru)</span>'
m = re.findall(r"position\s*:(.+);", s) #сохраняющие скобки
s = 'ABABABASOSAHIDHOAHABABABABABABAB'
m = re.findall(r"(?:AB)+", s) #НЕ сохраняющие скобки


#m = re.findall("[а-яё]даа", s)
#поиск бывает: мажорный и минорный
