# Определите количество цифр с чётным числовым значением в
# 36-ричной записи числа, заданного выражением:
# 5
# ⋅
# 129
# 6
# 2021
# −
# 4
# ⋅
# 21
# 6
# 2022
# +
# 3
# ⋅
# 3
# 6
# 2023
# −
# 2
# ⋅
# 6
# 2024
# −
# 2025
# 5⋅1296
# 2021
#  −4⋅216
# 2022
#  +3⋅36
# 2023
#  −2⋅6
# 2024
#  −2025.
def v36(d):
    ct = 0
    while d > 0:
        if (d % 36) % 2 == 0:
            ct += 1
        d //= 36
    return ct
d = 5 * 1296 ** 2021 - 4 * 216 ** 2022 + 3 * 36 ** 2023 - 2 * 6 ** 2024 - 2025
d = v36(d)
print(d)