for N in range(1, 10000):
    R = bin(N)[2:]
    if N % 2 == 0:
        R += '0'
    else:
        R += '1'
    if bin(N)[2:].count('1') % 2 == 0:
        R += '0'
    else:
        R += '1'
    R = int(R, 2)
    if R > 2023:
        print(R)

#Срезы
#s = 'СОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫСОЛНЫЙОД'
#print(s[0] + s[1] + s[2]) вывести первые 3 символа
# s[start_index:finish_index:step]
#print(s[5:])
# print(s[-3:])
# print(s[:3])
# print(s[2:])
# print(s[::-1])
# print(s[1:5:3])
# print(s[0:3:1])
# print(s[0:6:1])
# print(s[0:6:2])
# print(s[2:5:2])
#
# s = 'МЯЧ'
# s = s + 'И'
# print(s)